{
    "habilidades": [
        {
            "codigo": "EF06LP01",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Reconhecer a impossibilidade de uma neutralidade absoluta no relato de fatos e identificar diferentes graus de parcialidade/ imparcialidade dados pelo recorte feito e pelos efeitos de sentido advindos de escolhas feitas pelo autor, de forma a poder desenvolver uma atitude crítica frente aos textos jornalísticos e tornar-se consciente das escolhas feitas enquanto produtor de textos."
        },
        {
            "codigo": "EF06LP02",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Estabelecer relação entre os diferentes gêneros jornalísticos, compreendendo a centralidade da notícia."
        },
        {
            "codigo": "EF06LP03",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Analisar diferenças de sentido entre palavras de uma série sinonímica."
        },
        {
            "codigo": "EF06LP04",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Analisar a função e as flexões de substantivos e adjetivos e de verbos nos modos Indicativo, Subjuntivo e Imperativo: afirmativo e negativo."
        },
        {
            "codigo": "EF06LP05",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Identificar os efeitos de sentido dos modos verbais, considerando o gênero textual e a intenção comunicativa."
        },
        {
            "codigo": "EF06LP06",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Empregar, adequadamente, as regras de concordância nominal (relações entre os substantivos e seus determinantes) e as regras de concordância verbal (relações entre o verbo e o sujeito simples e composto)."
        },
        {
            "codigo": "EF06LP07",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Identificar, em textos, períodos compostos por coordenação e subordinação e os conectivos que expressam relações de sentido entre as orações."
        },
        {
            "codigo": "EF06LP08",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Identificar, em texto ou sequência textual, orações como unidades constituídas em torno de um núcleo verbal e períodos como conjunto de orações conectadas."
        },
        {
            "codigo": "EF06LP09",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Classificar, em texto ou sequência textual, os períodos simples compostos."
        },
        {
            "codigo": "EF06LP10",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Identificar sintagmas nominais e verbais como constituintes imediatos da oração."
        },
        {
            "codigo": "EF06LP11",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Utilizar, ao produzir texto, conhecimentos linguísticos e gramaticais: tempos verbais, concordância nominal e verbal, regras ortográficas, pontuação etc."
        },
        {
            "codigo": "EF06LP12",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Utilizar, ao produzir texto, recursos de coesão referencial (nome e pronomes), recursos semânticos de sinonímia, antonímia e homonímia e mecanismos de representação de diferentes vozes (discurso direto e indireto)."
        },
        {
            "codigo": "EF06LP13",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Analisar aspectos sociodiscursivos, temáticos, composicionais e estilísticos dos gêneros jornalísticos e publicitários, tendo em vista as condições de produção, as características do gênero, do suporte, do público-alvo, considerando a forma de circulação, tipo de mídia, finalidade etc."
        },
        {
            "codigo": "EF06LP14",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Considerar a forma de circulação, tipo de mídia, finalidade etc., e analisar aspectos relativos à construção composicional e às marcas linguísticas características dos gêneros jornalísticos, tendo em vista as condições de produção, as características do gênero, do suporte, do público-alvo."
        },
        {
            "codigo": "EF06LP15",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Produzir textos jornalísticos de diferentes gêneros, observando os aspectos relativos ao tratamento temático, à forma composicional e ao estilo, visando adequar o texto à situação comunicativa e ao suporte."
        },
        {
            "codigo": "EF06LP16",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Configurar adequadamente o texto segundo as características do gênero, do suporte, do público-alvo, considerando a forma de circulação do texto e as finalidades pretendidas."
        },
        {
            "codigo": "EF06LP17",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Elaborar roteiro para a produção de um telejornal com notícias e textos de apoio que tenham relevância para a escola e a comunidade."
        },
        {
            "codigo": "EF06LP18",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Analisar, tendo em vista o contexto de produção, a forma de organização das sequências descritivas e expositivas (definição, classificação, enumeração, comparação, causa e consequência) em textos informativos e em verbetes de enciclopédia."
        },
        {
            "codigo": "EF06LP19",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Produzir textos do gênero textual em foco, a partir da análise das características dos gêneros jornalísticos."
        },
        {
            "codigo": "EF06LP20",
            "componente": "LP",
            "etapa": "EF",
            "ano": 6,
            "descricao": "Identificar e analisar a situação comunicativa de textos pertencentes aos gêneros literários e de entretenimento, reconhecendo para que foram produzidos, onde circulam, quem os produziu e a quem se destinam."
        }
    ]
} 